wosayttn/M55M1BSP/Library/StdDriver/src/spi.c
/**************************************************************************//**
 * @file     spi.c
 * @version  V1.00
 * @brief    SPI driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/
#define SPI_Reset(spi)          SPI_Close(spi)

/** @addtogroup SPI_Driver SPI Driver
  @{
*/

/** @addtogroup SPI_EXPORTED_FUNCTIONS SPI Exported Functions
  @{
*/
static uint32_t SPII2S_GetSourceClockFreq(SPI_T *i2s);

/**
 * @brief Select PCLK as the clock source of SPI
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_GetPCLKSrc(SPI_T *spi)
{
    uint32_t u32RetValue = 0;

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Select PCLK as the clock source of SPI */
    if (spi == SPI0)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI0SEL_Msk)) | CLK_SPISEL_SPI0SEL_PCLK0;
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else if (spi == SPI1)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI1SEL_Msk)) | CLK_SPISEL_SPI1SEL_PCLK2;
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK1Freq();
    }
    else if (spi == SPI2)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI2SEL_Msk)) | CLK_SPISEL_SPI2SEL_PCLK0;
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else if (spi == SPI3)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI3SEL_Msk)) | CLK_SPISEL_SPI3SEL_PCLK2;
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }

    /* Lock protected registers */
    SYS_LockReg();

    return u32RetValue;
}

/**
 * @brief Check SPI3 clock source
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_CheckSPI3ClSrc(void)
{
    uint32_t u32ClkSrc = 0;

    switch (CLK->SPISEL & CLK_SPISEL_SPI3SEL_Msk)
    {
        case CLK_SPISEL_SPI3SEL_HXT:
            u32ClkSrc = __HXT; /* Clock source is HXT */
            break;

        case CLK_SPISEL_SPI3SEL_APLL1_DIV2:
            u32ClkSrc = (CLK_GetAPLL1ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI3SEL_APLL0_DIV2:
            u32ClkSrc = (CLK_GetAPLL0ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI3SEL_PCLK2:
            u32ClkSrc = CLK_GetPCLK2Freq(); /* Clock source is PCLK0 */
            break;

        case CLK_SPISEL_SPI3SEL_HIRC:
            u32ClkSrc = __HIRC; /* Clock source is HIRC */
            break;

        case CLK_SPISEL_SPI3SEL_HIRC48M:
            u32ClkSrc = __HIRC48M; /* Clock source is HIRC48M */
            break;
    }

    return u32ClkSrc;
}

/**
 * @brief Check SPI2 clock source
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_CheckSPI2ClkSrc(void)
{
    uint32_t u32ClkSrc = 0;

    switch (CLK->SPISEL & CLK_SPISEL_SPI2SEL_Msk)
    {
        case CLK_SPISEL_SPI2SEL_HXT:
            u32ClkSrc = __HXT; /* Clock source is HXT */
            break;

        case CLK_SPISEL_SPI2SEL_APLL1_DIV2:
            u32ClkSrc = (CLK_GetAPLL1ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI2SEL_APLL0_DIV2:
            u32ClkSrc = (CLK_GetAPLL0ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI2SEL_PCLK0:
            u32ClkSrc = CLK_GetPCLK0Freq(); /* Clock source is PCLK0 */
            break;

        case CLK_SPISEL_SPI2SEL_HIRC:
            u32ClkSrc = __HIRC; /* Clock source is HIRC */
            break;

        case CLK_SPISEL_SPI2SEL_HIRC48M:
            u32ClkSrc = __HIRC48M; /* Clock source is HIRC48M */
            break;
    }

    return u32ClkSrc;
}

/**
 * @brief Check SPI1 clock source
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_CheckSPI1ClkSrc(void)
{
    uint32_t u32ClkSrc = 0;

    switch (CLK->SPISEL & CLK_SPISEL_SPI1SEL_Msk)
    {
        case CLK_SPISEL_SPI1SEL_HXT:
            u32ClkSrc = __HXT; /* Clock source is HXT */
            break;

        case CLK_SPISEL_SPI1SEL_APLL1_DIV2:
            u32ClkSrc = (CLK_GetAPLL1ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI1SEL_APLL0_DIV2:
            u32ClkSrc = (CLK_GetAPLL0ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI1SEL_PCLK2:
            u32ClkSrc = CLK_GetPCLK2Freq(); /* Clock source is PCLK0 */
            break;

        case CLK_SPISEL_SPI1SEL_HIRC:
            u32ClkSrc = __HIRC; /* Clock source is HIRC */
            break;

        case CLK_SPISEL_SPI1SEL_HIRC48M:
            u32ClkSrc = __HIRC48M; /* Clock source is HIRC48M */
            break;
    }

    return u32ClkSrc;
}

/**
 * @brief Check SPI0 clock source
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_CheckSPI0ClkSrc(void)
{
    uint32_t u32ClkSrc = 0;

    switch (CLK->SPISEL & CLK_SPISEL_SPI0SEL_Msk)
    {
        case CLK_SPISEL_SPI0SEL_HXT:
            u32ClkSrc = __HXT; /* Clock source is HXT */
            break;

        case CLK_SPISEL_SPI0SEL_APLL1_DIV2:
            u32ClkSrc = (CLK_GetAPLL1ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI0SEL_APLL0_DIV2:
            u32ClkSrc = (CLK_GetAPLL0ClockFreq() >> 1); /* Clock source is PLL */
            break;

        case CLK_SPISEL_SPI0SEL_PCLK0:
            u32ClkSrc = CLK_GetPCLK0Freq(); /* Clock source is PCLK0 */
            break;

        case CLK_SPISEL_SPI0SEL_HIRC:
            u32ClkSrc = __HIRC; /* Clock source is HIRC */
            break;

        case CLK_SPISEL_SPI0SEL_HIRC48M:
            u32ClkSrc = __HIRC48M; /* Clock source is HIRC48M */
            break;
    }

    return u32ClkSrc;
}

/**
  * @brief  This function make SPI module be ready to transfer.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32MasterSlave Decides the SPI module is operating in master mode or in slave mode. (SPI_SLAVE, SPI_MASTER)
  * @param[in]  u32SPIMode Decides the transfer timing. (SPI_MODE_0, SPI_MODE_1, SPI_MODE_2, SPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a SPI transaction.
  * @param[in]  u32BusClock The expected frequency of SPI bus clock in Hz.
  * @return Actual frequency of SPI peripheral clock.
  * @details By default, the SPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
  *          In Slave mode, the u32BusClock shall be NULL and the SPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target SPI clock rate.
  *          For example, if the SPI source clock rate is 12 MHz and the target SPI bus clock rate is 7 MHz, the
  *          actual SPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, SPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= SPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the SPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t SPI_Open(SPI_T *spi, uint32_t u32MasterSlave, uint32_t u32SPIMode, uint32_t u32DataWidth, uint32_t u32BusClock)
{
    uint32_t u32ClkSrc = 0U, u32Div, u32HCLKFreq, u32RetValue = 0U;

    /* Disable I2S mode */
    spi->I2SCTL &= ~SPI_I2SCTL_I2SEN_Msk;

